index.org
#+html_head: <link rel="stylesheet" href="css/org-page.css"/>
#+title: Xie Yuheng // 謝宇恆

- [[https://github.com/xieyuheng][github.com/xieyuheng]]
- [[./CV-CN][中文简历]] - [[https://github.com/xieyuheng/paper/blob/master/CV-CN.pdf][.pdf]]

* Writing

  - 2019-05-06 [[https://github.com/xieyuheng/cicada/blob/master/docs/a-recursive-combinatorial-description-of-cell-complex.md][A Recursive Combinatorial Description of cell-complex]]

  - 2018-07-22 [[./writing/de-bruijn-notation.html][Semantic of De Bruijn Notation and Bizarre Syntax Adventure]]
    - Discussions about syntax design of programming language.

  - 2018-07-18 [[./writing/fulfilling-type-system.html][Fulfilling Type System]]
    - In which I use partly inhabited typed-record as type,
      and fully inhabited typed-record to inhabits such type.

  - 2018-06-20 [[./writing/dependent-category.html][Dependent category]]
    - A generalization of category to model dependent type system.

  - 2016-06-14 [[./writing/function-compose-type-cut.html][Function compose, Type cut, and The algebra of logic]] ([[http://xieyuheng.github.io/paper/function-compose-type-cut.pdf][pdf]]) ([[./writing/function-compose-type-cut--demo][demo]])
    - for the ICFP 2016 at Nara.

* Translation

  - [[./translation/schizophrenia-in-contemporary-mathematics.html][schizophrenia in contemporary mathematics // 當代數學之精神分裂症 (未完)]]
    by Errett Bishop, 1973

  - [[./translation/a-constructivist-manifesto.html][a constructivist manifesto // 一個構造主義者的宣言]]
    by Errett Bishop, 1967

  - [[./translation/is-god-a-taoist.html][is god a taoist // 上帝是道家的嗎]]
    by Raymond Smullyan, 1977

* Lecture

  - [[http://the-little-language-designer.github.io/cicada-nymph/course/contents.html][experimental assembly programming experiment]]
    at SYSU, GuangZhou, 2015
