index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-06 Mon 18:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Xie Yuheng // 謝宇恆</title>
<meta name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Xie Yuheng // 謝宇恆</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfdab992">Writing</a></li>
<li><a href="#org5de128a">Translation</a></li>
<li><a href="#org5fc0c9f">Lecture</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p><a href="https://github.com/xieyuheng">github.com/xieyuheng</a></p></li>
<li><p><a href="./CV-CN">中文简历</a> - <a href="https://github.com/xieyuheng/paper/blob/master/CV-CN.pdf">.pdf</a></p></li></ul>

<div id="outline-container-orgfdab992" class="outline-2">
<h2 id="orgfdab992">Writing</h2>
<div class="outline-text-2" id="text-orgfdab992">
<ul class="org-ul">
<li><p>2019-05-06 <a href="https://github.com/xieyuheng/cicada/blob/master/docs/a-recursive-combinatorial-description-of-cell-complex.md">A Recursive Combinatorial Description of cell-complex</a></p></li>

<li><p>2018-07-22 <a href="./writing/de-bruijn-notation.html">Semantic of De Bruijn Notation and Bizarre Syntax Adventure</a></p><p><ul class="org-ul"></p><p><li><p>Discussions about syntax design of programming language.</p></li></ul></p></li>

<li><p>2018-07-18 <a href="./writing/fulfilling-type-system.html">Fulfilling Type System</a></p><p><ul class="org-ul"></p><p><li><p>In which I use partly inhabited typed-record as type,</p><p>and fully inhabited typed-record to inhabits such type.</p></li></ul></p></li>

<li><p>2018-06-20 <a href="./writing/dependent-category.html">Dependent category</a></p><p><ul class="org-ul"></p><p><li><p>A generalization of category to model dependent type system.</p></li></ul></p></li>

<li><p>2016-06-14 <a href="./writing/function-compose-type-cut.html">Function compose, Type cut, and The algebra of logic</a> (<a href="http://xieyuheng.github.io/paper/function-compose-type-cut.pdf">pdf</a>) (<a href="./writing/function-compose-type-cut--demo">demo</a>)</p><p><ul class="org-ul"></p><p><li><p>for the ICFP 2016 at Nara.</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-org5de128a" class="outline-2">
<h2 id="org5de128a">Translation</h2>
<div class="outline-text-2" id="text-org5de128a">
<ul class="org-ul">
<li><p><a href="./translation/schizophrenia-in-contemporary-mathematics.html">schizophrenia in contemporary mathematics // 當代數學之精神分裂症 (未完)</a></p><p>by Errett Bishop, 1973</p></li>

<li><p><a href="./translation/a-constructivist-manifesto.html">a constructivist manifesto // 一個構造主義者的宣言</a></p><p>by Errett Bishop, 1967</p></li>

<li><p><a href="./translation/is-god-a-taoist.html">is god a taoist // 上帝是道家的嗎</a></p><p>by Raymond Smullyan, 1977</p></li></ul>
</div>
</div>

<div id="outline-container-org5fc0c9f" class="outline-2">
<h2 id="org5fc0c9f">Lecture</h2>
<div class="outline-text-2" id="text-org5fc0c9f">
<ul class="org-ul">
<li><p><a href="http://the-little-language-designer.github.io/cicada-nymph/course/contents.html">experimental assembly programming experiment</a></p><p>at SYSU, GuangZhou, 2015</p></li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-05-06 Mon 18:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
